10/data/attachments/9c1644a1a2852fba.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_d535f6f4-5973-4e41-a281-afdc7dc84fea</nif:username>
            <nif:friendToBeAdded>Angela_community_Friend_74678_9</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>